In [1]:
import numpy as np
import pandas as pd

In [3]:
ufo_data = pd.read_csv('./data/uforawdata/ufosmerged.csv', usecols=[0, 2], low_memory=False)

In [4]:
ufo_data.describe()

                  datetime  state
count                69536  69532
unique               59880     51
top     11/7/2015 18:00:00     AZ
freq                   103   3233

In [5]:
ufo_data['datetime'] = pd.to_datetime(ufo_data['datetime'], errors='coerce')
#ufo_data.insert(1, 'year', ufo_data['datetime'].dt.year)
#ufo_data['year'] = ufo_data['year'].fillna(0).astype(int)
ufo_data['year'] = ufo_data['datetime'].dt.year #date
ufo_data['state'] = ufo_data['state'].str.upper()

In [6]:
ufo_data.head()

             datetime state    year
0 2004-01-01 00:00:00    AK  2004.0
1 2008-01-01 00:08:00    AK  2008.0
2 2009-01-01 01:15:00    AK  2009.0
3 2010-01-01 00:01:00    AK  2010.0
4 2010-01-01 00:20:00    AK  2010.0

In [7]:
us_states = np.asarray(['AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'FL', 'GA',
                        'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD', 'ME',
                        'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM',
                        'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
                        'UT', 'VA', 'VT', 'WA', 'WI', 'WV', 'WY'])

In [8]:
ufo_data = ufo_data[ufo_data['state'].isin(us_states)].sort_values('year')

In [9]:
print(ufo_data)

                 datetime state    year
40022 1899-12-30 20:00:00    NH  1899.0
59267 1899-12-30 18:00:00    TN  1899.0
59264 1899-12-30 21:00:00    TN  1899.0
55568 1899-12-30 21:00:00    RI  1899.0
23298 1899-12-30 02:45:00    KY  1899.0
52679 1899-12-30 21:40:00    OR  1899.0
50008 1899-12-30 22:00:00    OK  1899.0
38449 1899-12-30 18:30:00    NC  1899.0
61985 1899-12-30 14:00:00    UT  1899.0
52682 1899-12-30 18:00:00    OR  1899.0
44679 1899-12-30 02:00:00    NV  1899.0
68731 1899-12-30 17:30:00    WV  1899.0
34342 1899-12-30 21:21:00    MO  1899.0
11372 1899-12-30 22:00:00    CT  1899.0
1543  1899-12-30 18:00:00    AL  1899.0
2425  1899-12-30 01:10:00    AR  1899.0
61986 1899-12-30 05:00:00    UT  1899.0
68033 1899-12-30 11:00:00    WI  1899.0
32175 1899-12-30 03:00:00    MN  1899.0
44678 1899-12-30 03:00:00    NV  1899.0
59268 1899-12-30 13:00:00    TN  1899.0
63988 1905-07-02 00:00:00    VA  1905.0
34338 1930-08-10 23:00:00    MO  1930.0
42166 1930-06-30 20:00:00    NJ  1930.0
22036 1931-06-01 13:00:00    KS  1931.0
38649 1934-09-15 15:30:00    ND  1934.0
62    1936-10-15 17:00:00    AK  1936.0
52676 1937-06-15 00:00:00    OR  1937.0
1542  1939-06-01 20:00:00    AL  1939.0
16988 1939-07-07 00:00:00    IA  1939.0
...                   ...   ...     ...
40021                 NaT    NH     NaN
40023                 NaT    NH     NaN
42167                 NaT    NJ     NaN
43377                 NaT    NM     NaN
43378                 NaT    NM     NaN
43379                 NaT    NM     NaN
44675                 NaT    NV     NaN
44676                 NaT    NV     NaN
44677                 NaT    NV     NaN
44680                 NaT    NV     NaN
50009                 NaT    OK     NaN
50010                 NaT    OK     NaN
50011                 NaT    OK     NaN
52680                 NaT    OR     NaN
52681                 NaT    OR     NaN
52683                 NaT    OR     NaN
52684                 NaT    OR     NaN
55567                 NaT    RI     NaN
55569                 NaT    RI     NaN
57543                 NaT    SD     NaN
59265                 NaT    TN     NaN
59266                 NaT    TN     NaN
59269                 NaT    TN     NaN
59270                 NaT    TN     NaN
61987                 NaT    UT     NaN
63987                 NaT    VA     NaN
68034                 NaT    WI     NaN
68729                 NaT    WV     NaN
68732                 NaT    WV     NaN
68733                 NaT    WV     NaN

[69531 rows x 3 columns]

In [10]:
#ufo_data['state'].value_counts()
ufo_data.groupby(['state','year'])['state'].count()

state  year
AK     1936.0     1
       1943.0     1
       1949.0     2
       1954.0     1
       1955.0     1
       1957.0     4
       1962.0     1
       1966.0     2
       1967.0     2
       1968.0     6
       1969.0     8
       1972.0     2
       1973.0     2
       1974.0     4
       1975.0     2
       1976.0    10
       1977.0     2
       1978.0     6
       1980.0     2
       1981.0     2
       1982.0     2
       1983.0     2
       1984.0     4
       1985.0     4
       1986.0    10
       1987.0     6
       1988.0     4
       1989.0     4
       1990.0     6
       1993.0     2
                 ..
WY     1984.0     1
       1985.0     2
       1987.0     1
       1989.0     3
       1992.0     1
       1993.0     4
       1994.0     4
       1995.0     1
       1996.0     3
       1997.0     2
       1998.0     9
       1999.0    14
       2000.0     7
       2001.0    17
       2002.0    15
       2003.0     9
       2004.0     6
       2005.0    12
       2006.0    11
       2007.0     9
       2008.0    12
       2009.0     5
       2010.0    13
       2011.0    21
       2012.0    14
       2013.0    17
       2014.0    21
       2015.0    19
       2016.0    15
       2017.0     9
Name: state, Length: 2202, dtype: int64